lvx/base/InformationRegisters/бит_СинонимыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СинонимыОбъектов</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СинонимОбъекта</Name>
					<Comment>Синоним объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект для которого необходимо задать синоним</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидФормы</Name>
					<Comment>Вид формы для которой задается синоним (элемента, списка, выбора, документа)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыФормОбъекта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/CommonModules/бит_НазначениеСинонимовОбъектов/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// 1С:Бухучет и торговля
//  ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С МЕХАНИЗМОМ НАЗНАЧЕНИЯ СИНОНИМОВ ОБЪЕКТОВ
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ПолучениеСинонимаОбъекта
	
// Процедура выводит заголовок формы для объекта
// установленный в регистре сведений "бит_СинонимыОбъектов".
// 
// Параметры:
//  МетаданныеОбъекта - МетаданныеОбъекта, СправочникСсылка.бит_ОбъектыСистемы.
//  ФормаОбъекта      - ФормаОбъекта, для которой необходимо установить заголовок.
//  ВидФормы          - ПеречислениеСсылка.бит_ВидыФормОбъекта.
//  ЭтотОбъект        - Объект, по умолчанию Неопределено.
// 
Процедура ВывестиЗаголовокФормы(МетаданныеОбъекта, ФормаОбъекта, ВидФормы, ЭтотОбъект = Неопределено) Экспорт
	
	// Если передана ссылка на объект доступа, тогда
	Если ТипЗнч(МетаданныеОбъекта) = Тип("СправочникСсылка.бит_ОбъектыСистемы") Тогда
		ОбъектДоступа = МетаданныеОбъекта;
	Иначе
		// Получим объект доступа по метаданным объекта.
		ОбъектДоступа = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаданныеОбъекта);
	КонецЕсли;
	
    Если Не ЗначениеЗаполнено(ОбъектДоступа) Тогда
        Возврат;
    КонецЕсли;
    
    // Поищем установленный синоним для объекта.
    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ОбъектДоступа", ОбъектДоступа);
    Запрос.УстановитьПараметр("ВидФормы"     , ВидФормы);
    
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    СинонимыОбъектов.СинонимОбъекта,
    |    СинонимыОбъектов.ШаблонЗаполнения
    |ИЗ
    |    РегистрСведений.бит_СинонимыОбъектов КАК СинонимыОбъектов
    |ГДЕ
    |    СинонимыОбъектов.Объект = &ОбъектДоступа
    |    И СинонимыОбъектов.ВидФормы = &ВидФормы";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат;
    КонецЕсли;    



	
    ВыборкаЗапроса = РезультатЗапроса.Выбрать();
    
    Если ВыборкаЗапроса.Следующий() Тогда
        
        СинонимОбъекта   = ВыборкаЗапроса.СинонимОбъекта;
        ШаблонЗаполнения = ВыборкаЗапроса.ШаблонЗаполнения;
		
		// если задан синоним, то пользователю необязательно знать техногенное имя
		Если ТипЗнч(ФормаОбъекта) = Тип("УправляемаяФорма")
			И (ЗначениеЗаполнено(СинонимОбъекта)
			ИЛИ ЗначениеЗаполнено(ШаблонЗаполнения)) Тогда
			
			ФормаОбъекта.АвтоЗаголовок = Ложь;
		КонецЕсли;
		
		// Если шаблон заполнения не установлен, тогда
        // заголовком формы будет являтся установленный синоним.
        Если Не ЗначениеЗаполнено(ШаблонЗаполнения) Тогда
            ФормаОбъекта.Заголовок = ?(ЗначениеЗаполнено(СинонимОбъекта), СинонимОбъекта, ФормаОбъекта.Заголовок);
			Возврат;
        КонецЕсли;
        
        // Установим заголовок формы по шаблону заполнения.
        УстановитьЗаголовокПоШаблонуЗаполнения(МетаданныеОбъекта, ФормаОбъекта, СинонимОбъекта, ШаблонЗаполнения, ЭтотОбъект);
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеЗначениямиПоУмолчанию

// Процедура заполняет Синонимы объектов значениями по умолчанию.
// Используется в ЕРП.
// 
Процедура ЗаполнитьСинонимыОбъектовИзМакета() Экспорт
	
	Макет = Справочники.бит_ОбъектыСистемы.ПолучитьМакет("СинонимыПоУмолчанию");
	
	ТипСтрока = Новый ОписаниеТипов("Строка", ,
				Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
    ТаблицаСДанными = Новый ТаблицаЗначений;
    ТаблицаСДанными.Колонки.Добавить("ИмяКоллекции", ТипСтрока);
    ТаблицаСДанными.Колонки.Добавить("ИмяОбъектаКоллекции", ТипСтрока);
    ТаблицаСДанными.Колонки.Добавить("СинонимФормыСписка", ТипСтрока);
    ТаблицаСДанными.Колонки.Добавить("СинонимФормыВыбора", ТипСтрока);
    ТаблицаСДанными.Колонки.Добавить("СинонимФормыЭлемента", ТипСтрока);
	
    ПоляСтруктуры = "ИмяКоллекции, ИмяОбъектаКоллекции, ВидФормы, СинонимФормыСписка, СинонимФормыВыбора, СинонимФормыЭлемента"; 
	
	ЕстьОбъектыМСФО = бит_ОбщегоНазначения.ЕстьОбъектыМСФО();
	
    НомСтроки = 2;
    // Считываем данные из макета.
    Пока Истина Цикл
        Данные = Новый Структура(ПоляСтруктуры);
		
		СинонимыНазначены = Ложь;
		НомКолонки = 1;
        Для каждого КлючИЗначение Из Данные Цикл
            ИмяПоля  = КлючИЗначение.Ключ;
            Значение = СокрЛП(Макет.Область(НомСтроки, НомКолонки, НомСтроки, НомКолонки).Текст);
			
			Если СтрНачинаетсяС(ИмяПоля, "Синоним") Тогда
				Если НЕ ЕстьОбъектыМСФО И СтрНайти(Значение, "международ") > 0 Тогда
					Значение = "";
				КонецЕсли;
				Если НЕ ПустаяСтрока(Значение) Тогда
					СинонимыНазначены = Истина;
				КонецЕсли;
			КонецЕсли;
			
            Данные[ИмяПоля] = Значение;
            
            НомКолонки = НомКолонки + 1;
        КонецЦикла;
		
		Если СинонимыНазначены Тогда
	        НовСтрока = ТаблицаСДанными.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Данные);
		КонецЕсли;
        
        НомСтроки = НомСтроки + 1;
		
		Если ПустаяСтрока(Макет.Область(НомСтроки, 2, НомСтроки, 2).Текст) Тогда
			Прервать;
		КонецЕсли;
    КонецЦикла;
    
    Для каждого ТекСтрока Из ТаблицаСДанными Цикл
        
        // Получим объект доступа по метаданным объекта.
        ОбъектДоступа = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные[ТекСтрока.ИмяКоллекции][ТекСтрока.ИмяОбъектаКоллекции]);
        
        Если Не ЗначениеЗаполнено(ОбъектДоступа) Тогда
            Продолжить;
        КонецЕсли;
                 
		ТекОб = ОбъектДоступа.ПолучитьОбъект();
		ТекОб.Наименование         = ТекСтрока.СинонимФормыСписка;
		ТекОб.ЗаголовокФормыВыбора = ТекСтрока.СинонимФормыВыбора;
		ТекОб.ЗаголовокЭлемента    = ТекСтрока.СинонимФормыЭлемента;
		
		ТекОб.ОбменДанными.Загрузка = Истина;
		ТекОб.Записать();
		
    КонецЦикла;
	
	ТекстСообщения = НСтр("ru='Загрузка синонимов объектов завершена.';en='Object synonyms loaded.'");
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает заголовок по шаблону заполнения.
// 
// Параметры
//  МетаданныеОбъекта - МетаданныеОбъекта.
//  Элемент           - Форма или ЭлементУправления, для кот. необходимо установить заголовок.
//  СинонимЭлемента   - Строка.
//  ШаблонЗаполнения  - Строка.
//  ЭтотОбъект        - Объект.
// 
Процедура УстановитьЗаголовокПоШаблонуЗаполнения(МетаданныеОбъекта, Элемент, СинонимЭлемента, ШаблонЗаполнения, ЭтотОбъект)

	Попытка        
        ЗаголовокПоШаблону = "";        
        // Получим текст заголовка по шаблону.
    	ЗаголовокПоШаблону = ПолучитьТекстЗаголовкаПоШаблону(МетаданныеОбъекта, СинонимЭлемента, ШаблонЗаполнения, ЭтотОбъект);
        Элемент.Заголовок  = ЗаголовокПоШаблону;        
    Исключение
		ТекстСообщения = НСтр("ru='Не удалось установить заголовок.
								  |Ошибка заполнения по шаблону для формы объекта (регистр сведений ""Синонимы объектов"").';
							  |en='Failed to set header.
								  |Error filling in the template for the object form (information register ""Synonyms of objects"").'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
    КонецПопытки;
    
КонецПроцедуры // УстановитьЗаголовокПоШаблонуЗаполнения()

// Функция получает текст заголовка по шаблону.
// 
// Параметры:
//  МетаданныеОбъекта - МетаданныеОбъекта.
//  СинонимЭлемента   - Строка.
//  ШаблонЗаполнения  - Строка.
//  ЭтотОбъект        - Объект.
// 
// Возвращаемое значение:
//  ЗаголовокПоШаблону - Строка.
// 
Функция ПолучитьТекстЗаголовкаПоШаблону(МетаданныеОбъекта, СинонимЭлемента, Знач ШаблонЗаполнения, ЭтотОбъект)
    
    ЗаголовокПоШаблону = ШаблонЗаполнения;
    
    Поз_1 = Найти(ЗаголовокПоШаблону, "[");
    
    Если Поз_1 <> 0 Тогда
        
        Поз_2           = Найти(ЗаголовокПоШаблону, "]");
        ДляЗамены       = Сред(ЗаголовокПоШаблону, Поз_1, Поз_2 - Поз_1 + 1);
        СвойствоОбъекта = Сред(ЗаголовокПоШаблону, Поз_1 + 1, Поз_2 - Поз_1 - 1);
        
        Если ВРег(СвойствоОбъекта) = "СИНОНИМ" Тогда
            
            ТекстСинонима  = ?(ЗначениеЗаполнено(СинонимЭлемента), СинонимЭлемента, МетаданныеОбъекта.Синоним);
            ЗаголовокПоШаблону = СтрЗаменить(ЗаголовокПоШаблону, ДляЗамены, ТекстСинонима);
            
        Иначе
            ЗаголовокПоШаблону = СтрЗаменить(ЗаголовокПоШаблону, ДляЗамены, ЭтотОбъект[СвойствоОбъекта]);
        КонецЕсли;
        
        Возврат ПолучитьТекстЗаголовкаПоШаблону(МетаданныеОбъекта, СинонимЭлемента, ЗаголовокПоШаблону, ЭтотОбъект);
        
    Иначе
        Возврат ЗаголовокПоШаблону;
    КонецЕсли;
    
КонецФункции // ПолучитьТекстЗаголовкаПоШаблону()

#КонецОбласти
